Revit 2027 API
ViewSchedule.GetDefaultNameForKeySchedule Method
 Gets the default view name that will be used when creating a key schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GetDefaultNameForKeySchedule(
	Document document,
	ElementId categoryId
)
Public Shared Function GetDefaultNameForKeySchedule (
	document As Document,
	categoryId As ElementId
) As String
public:
static String^ GetDefaultNameForKeySchedule(
	Document^ document,
	ElementId^ categoryId
)
static member GetDefaultNameForKeySchedule :
        document : Document *
        categoryId : ElementId -> string
Parameters
document Document
 The document to which the new schedule will be added.
categoryId ElementId
 The ID of the category of elements that the schedule's keys will be associated with.
Return Value
String
 The default view name.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- categoryId is not a valid category for a key schedule.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace